In [1]:
people = {
    'first':['dudung','eman','Bobi'],
    'last':['suherman', 'suherman','Subobi'],
    'email':['dudung@gmail.com','emangnye@gmail.com','bobie2yahoo.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first      last               email
0  dudung  suherman    dudung@gmail.com
1    eman  suherman  emangnye@gmail.com
2    Bobi    Subobi     bobie2yahoo.com

#### melihat isi kolom

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

#### Mengganti nama kolom

In [6]:
df.columns = ['nama_depan','nama_belakang','email']

In [7]:
df.columns

Index(['nama_depan', 'nama_belakang', 'email'], dtype='object')

In [8]:
df

  nama_depan nama_belakang               email
0     dudung      suherman    dudung@gmail.com
1       eman      suherman  emangnye@gmail.com
2       Bobi        Subobi     bobie2yahoo.com

#### Mengubah header kolom menjadi huruf besar semua

In [9]:
df.columns = [x.upper() for x in df.columns]
df

  NAMA_DEPAN NAMA_BELAKANG               EMAIL
0     dudung      suherman    dudung@gmail.com
1       eman      suherman  emangnye@gmail.com
2       Bobi        Subobi     bobie2yahoo.com

#### Membuang underscore di nama header

In [10]:
df.columns = df.columns.str.replace('_', ' ')
df

  NAMA DEPAN NAMA BELAKANG               EMAIL
0     dudung      suherman    dudung@gmail.com
1       eman      suherman  emangnye@gmail.com
2       Bobi        Subobi     bobie2yahoo.com

#### Balik lagi ke lower case

In [11]:
df.columns = [x.lower() for x in df.columns]
df

  nama depan nama belakang               email
0     dudung      suherman    dudung@gmail.com
1       eman      suherman  emangnye@gmail.com
2       Bobi        Subobi     bobie2yahoo.com

#### mengganti nama header kolom, waktu di atas khan begini caranya :

#### df.columns = ['nama_depan','nama_belakang','email']

#### cara lain dengan dictionaries adalah

In [12]:
df.rename(columns={'nama depan':'namenye siape','nama belakang':'belakangnye ade name kagak','email':'emailnye woi'})

  namenye siape belakangnye ade name kagak        emailnye woi
0        dudung                   suherman    dudung@gmail.com
1          eman                   suherman  emangnye@gmail.com
2          Bobi                     Subobi     bobie2yahoo.com

#### Mengganti isi suatu baris

In [13]:
df.loc[2] = ['John','Drago','johndrago@gmail.com']
df

  nama depan nama belakang                email
0     dudung      suherman     dudung@gmail.com
1       eman      suherman   emangnye@gmail.com
2       John         Drago  johndrago@gmail.com

#### menampilkan isi dari baris ke 2, tapi hanya nama belakang dan email doang

In [14]:
df.loc[2,['nama belakang','email']]

nama belakang                  Drago
email            johndrago@gmail.com
Name: 2, dtype: object

In [15]:
df

  nama depan nama belakang                email
0     dudung      suherman     dudung@gmail.com
1       eman      suherman   emangnye@gmail.com
2       John         Drago  johndrago@gmail.com

#### Setelah kita ganti nama kolom dengan fungsi

#### df.columns = ['nama_depan','nama_belakang','email']

#### walaupun kita ganti dengan method rename, nama kolom tetap akan kembali ke aslinya sesuai dengan fungsi df.columns

#### Mengganti isi dari kolom "nama depan" dari baris 1 misalnya

In [16]:
df.loc[1,'nama depan'] = 'Hebat'

In [17]:
df

  nama depan nama belakang                email
0     dudung      suherman     dudung@gmail.com
1      Hebat      suherman   emangnye@gmail.com
2       John         Drago  johndrago@gmail.com

#### Kita ingin ganti "nama depan" menjadi huruf kecil semua

In [18]:
 df['nama depan'].str.lower()

0    dudung
1     hebat
2      john
Name: nama depan, dtype: object

In [19]:
df

  nama depan nama belakang                email
0     dudung      suherman     dudung@gmail.com
1      Hebat      suherman   emangnye@gmail.com
2       John         Drago  johndrago@gmail.com

#### tetapi kalau kita ingin melihat isi tabel nya, maka kolom nama depan ga brubah jadi huruf kecil

#### Supaya bisa berubah kolom nama depan jadi huruf kecil semua, kita harus mendefinisikannya

In [20]:
df['nama depan'] = df['nama depan'].str.lower()

In [21]:
df

  nama depan nama belakang                email
0     dudung      suherman     dudung@gmail.com
1      hebat      suherman   emangnye@gmail.com
2       john         Drago  johndrago@gmail.com

### fungsi apply, Map dan Applymap di pandas, bisa di apply ke baris maupun kolom

#### kita ingin mengubah kolom email jadi huruf besar semua

####  syaratnya adalah membuat definisi dulu, baru kita gunakan method apply nya

In [22]:
def update_email(email):
    return email.upper()

In [23]:
df['email'].apply(update_email)

0       DUDUNG@GMAIL.COM
1     EMANGNYE@GMAIL.COM
2    JOHNDRAGO@GMAIL.COM
Name: email, dtype: object

#### nama def nya kita ganti ya jadi apaan, bisa ga ya

In [24]:
def apaan(email):
    return email.upper()

In [25]:
df['email'].apply(apaan)

0       DUDUNG@GMAIL.COM
1     EMANGNYE@GMAIL.COM
2    JOHNDRAGO@GMAIL.COM
Name: email, dtype: object

#### kita patenkan di data frame

In [26]:
df['email'] = df['email'].apply(apaan)

In [27]:
df

  nama depan nama belakang                email
0     dudung      suherman     DUDUNG@GMAIL.COM
1      hebat      suherman   EMANGNYE@GMAIL.COM
2       john         Drago  JOHNDRAGO@GMAIL.COM

#### Fungsi lambda sebagai pengganti def

''' kita khan tadi punya fungsi

def apaan(email):return email.upper(), 

sebagai gantinya kita bisa gunakan fungsi lambda'''

In [28]:
def update_email(email):
    return email.upper()

In [29]:
df

  nama depan nama belakang                email
0     dudung      suherman     DUDUNG@GMAIL.COM
1      hebat      suherman   EMANGNYE@GMAIL.COM
2       john         Drago  JOHNDRAGO@GMAIL.COM

In [30]:
df = df.apply(lambda x: x.min())

In [31]:
df

nama depan                 dudung
nama belakang               Drago
email            DUDUNG@GMAIL.COM
dtype: object

### Ini lambda perlu di pelajari lagi, belum ngerti aku

In [32]:
alamat = {
    'dudung':'Bandung',
    'hebat':'Medan',
    'John':'Jakarta'
}

#### kita kembali lagi ke awal data frame yg asli

In [33]:
people = {
    'first':['dudung','eman','Bobi'],
    'last':['suherman', 'suherman','Subobi'],
    'email':['dudung@gmail.com','emangnye@gmail.com','bobie2yahoo.com']
}

In [34]:
df = pd.DataFrame(people)
df

    first      last               email
0  dudung  suherman    dudung@gmail.com
1    eman  suherman  emangnye@gmail.com
2    Bobi    Subobi     bobie2yahoo.com

#### mengetahui jumlah huruf di kolom email

In [35]:
 df['email'].apply(len)

0    16
1    18
2    15
Name: email, dtype: int64

#### menganti isi kolom email menjadi huruf title

In [36]:
df['email'] = df['email'].apply(lambda x: x.title())

In [37]:
df

    first      last               email
0  dudung  suherman    Dudung@Gmail.Com
1    eman  suherman  Emangnye@Gmail.Com
2    Bobi    Subobi     Bobie2Yahoo.Com

#### Tapi kalau ingin mengetahui jumlah baris di tiap kolom

In [38]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

#### bisa juga dengan cara sbb

In [39]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

#### mengetahui jumlah baris di kolom tertentu

In [40]:
len(df['email'])

3

In [41]:
df.apply(pd.Series.min)

first               Bobi
last              Subobi
email    Bobie2Yahoo.Com
dtype: object

#### menggunakan applymap untuk setiap cell dari tabel

In [42]:
df.applymap(len)
df

C:\Users\rbagu\AppData\Local\Temp\ipykernel_18456\31918941.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

    first      last               email
0  dudung  suherman    Dudung@Gmail.Com
1    eman  suherman  Emangnye@Gmail.Com
2    Bobi    Subobi     Bobie2Yahoo.Com

#### sekarang kita terapkan ke semua cell, untuk membentuk hurufnya kecil semua

In [43]:
df.applymap(str.lower)

C:\Users\rbagu\AppData\Local\Temp\ipykernel_18456\357608748.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.lower)

    first      last               email
0  dudung  suherman    dudung@gmail.com
1    eman  suherman  emangnye@gmail.com
2    bobi    subobi     bobie2yahoo.com

#### Mengganti isi suatu kolom

In [44]:
df['first'].replace({'dudung':'chris','eman':'Mary'})

0    chris
1     Mary
2     Bobi
Name: first, dtype: object

In [45]:
df['first'].map({'dudung':'deddy', 'eman': 'andri'})

0    deddy
1    andri
2      NaN
Name: first, dtype: object

#### Kita paten kan

In [46]:
df['first'] = df['first'].map({'dudung':'deddy', 'eman': 'andri'})

In [47]:
df

   first      last               email
0  deddy  suherman    Dudung@Gmail.Com
1  andri  suherman  Emangnye@Gmail.Com
2    NaN    Subobi     Bobie2Yahoo.Com

#### Kita beralih ke Panda demo